
## Plan Result (aat)




<pre><code>Plan: 4 to add, 8 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_monitor_data_collection_rule_association.linux_vm_dcra[&#34;ccd-data-0&#34;]
  * azurerm_monitor_data_collection_rule_association.linux_vm_dcra[&#34;ccd-data-1&#34;]
  * azurerm_monitor_data_collection_rule_association.linux_vm_dcra[&#34;ccd-data-2&#34;]
  * azurerm_monitor_data_collection_rule_association.linux_vm_dcra[&#34;ccd-data-3&#34;]
* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.bastion_es_rule[0]
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic.azurerm_resource_group.elastic-resourcegroup
  * module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_virtual_machine.elk_vms["ccd-data-0"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_machine" "elk_vms" {
      + id                   = (known after apply)
      + identity             = (known after apply)
      + location             = (known after apply)
      + name                 = "ccd-data-0"
      + power_state          = (known after apply)
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + public_ip_address    = (known after apply)
      + public_ip_addresses  = (known after apply)
      + resource_group_name  = "ccd-elastic-search-aat"
    }

  # data.azurerm_virtual_machine.elk_vms["ccd-data-1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_machine" "elk_vms" {
      + id                   = (known after apply)
      + identity             = (known after apply)
      + location             = (known after apply)
      + name                 = "ccd-data-1"
      + power_state          = (known after apply)
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + public_ip_address    = (known after apply)
      + public_ip_addresses  = (known after apply)
      + resource_group_name  = "ccd-elastic-search-aat"
    }

  # data.azurerm_virtual_machine.elk_vms["ccd-data-2"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_machine" "elk_vms" {
      + id                   = (known after apply)
      + identity             = (known after apply)
      + location             = (known after apply)
      + name                 = "ccd-data-2"
      + power_state          = (known after apply)
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + public_ip_address    = (known after apply)
      + public_ip_addresses  = (known after apply)
      + resource_group_name  = "ccd-elastic-search-aat"
    }

  # data.azurerm_virtual_machine.elk_vms["ccd-data-3"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_machine" "elk_vms" {
      + id                   = (known after apply)
      + identity             = (known after apply)
      + location             = (known after apply)
      + name                 = "ccd-data-3"
      + power_state          = (known after apply)
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + public_ip_address    = (known after apply)
      + public_ip_addresses  = (known after apply)
      + resource_group_name  = "ccd-elastic-search-aat"
    }

  # azurerm_monitor_data_collection_rule_association.linux_vm_dcra["ccd-data-0"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between the ELK linux VMs and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = "vm-ccd-data-0-aat-dcra"
      + target_resource_id      = (known after apply)
    }

  # azurerm_monitor_data_collection_rule_association.linux_vm_dcra["ccd-data-1"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between the ELK linux VMs and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = "vm-ccd-data-1-aat-dcra"
      + target_resource_id      = (known after apply)
    }

  # azurerm_monitor_data_collection_rule_association.linux_vm_dcra["ccd-data-2"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between the ELK linux VMs and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = "vm-ccd-data-2-aat-dcra"
      + target_resource_id      = (known after apply)
    }

  # azurerm_monitor_data_collection_rule_association.linux_vm_dcra["ccd-data-3"] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between the ELK linux VMs and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = "vm-ccd-data-3-aat-dcra"
      + target_resource_id      = (known after apply)
    }

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "data_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-data-asg"
      + resource_group_name = "ccd-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "kibana_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-asg"
      + resource_group_name = "ccd-elastic-search-aat"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "cluster_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-cluster-nsg"
      + resource_group_name = "ccd-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "kibana_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-nsg"
      + resource_group_name = "ccd-elastic-search-aat"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.bastion_es_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "bastion_es_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Bastion_To_ES"
        name                                       = "Bastion_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_Kibana"
        name                                       = "Bastion_only_Kibana"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_SSH"
        name                                       = "Bastion_only_SSH"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat"
        name       = "ccd-elastic-search-aat"
      ~ tags       = {
          - "application"         = "core-case-data"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-05-21T07:37:58Z"
          - "managedBy"           = "CCD"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd"
        name                     = "es-ccd"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              + outputs        = {
                  + actionGroupId = {
                      + type  = "string"
                      + value = "[resourceId('microsoft.insights/actionGroups', parameters('actionGroupName'))]"
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 8 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":112,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->